/*
    Задача 19
        Напишите программу, которая принимает на вход пятизначное число 
        и проверяет, является ли оно палиндромом
*/


Console.Clear();

int ReadInputInt(string mess)
{
    Console.Write(mess);
    return Convert.ToInt32(Console.ReadLine() ?? "0");
}
void WriteMess(string mess)
{
    Console.WriteLine(mess);
}

void ChoiceProggram()
{
    for (; ; )
    {
        Console.Clear();
        int choice = ReadInputInt(
            "\r 1. Поиск палиндрома в пятизначном числе." +
            "\n 2. Поиск палиндрома в любом числе." +
            "\n 3. Поиск палиндрома в пятизначном числе с помощью библиотеки Dictionary." +
            "\n\nВыберите программу которую хотите запустить: ");

        if (choice > 0 && choice < 4)
        {
            if (choice == 1) Palindrome5();
            if (choice == 2) PalindromeAll();
            if (choice == 3) PalindromeDict();
            break;
        }
        else
        {
            WriteMess("\nВы ввели не номер пункта" +
            "\nНажмите любую клавишу для повторения попытки.");
            Console.ReadKey();
        }
    }
}

void Palindrome5()
{
    Console.Clear();
    WriteMess("Работает программа для поиска палиндрома в пятизначном числе");

    int num = ReadInputInt("Введите пятизначное число: ");

    if (num < 10000 || num > 100000) WriteMess($"Вы ввели не пятизначное число!");
    else
    {
        if ((num / 10000 == num % 10) && (num / 1000 % 10 == num / 10 % 10)) WriteMess("Введеное число - палиндром");
        else WriteMess($"Введеное число - не палиндром!");
    }
}

void PalindromeAll()
{
    Console.Clear();
    WriteMess("Работает программа для поиска палиндрома в любом числе");

    int num = ReadInputInt("Введите любое число: ");
    WriteMess(Palindrome(num) ? "Введёное число - палиндром" : "Введёное число - не палиндром");

}
bool Palindrome(int numer)
{
    int len = numer.ToString().Length;
    int del = 10;
    bool answer = false;

    for (int i = 0; i < len / 2; i++)
    {
        if ((numer / (int)Math.Pow(del, len - i - 1) % del) == (numer / (int)Math.Pow(del, i) % del))
        {
            answer = true;
        }
        else
        {
            answer = false;

            break;
        }
    }


    return answer;
}

void PalindromeDict()
{
    Console.Clear();
    WriteMess("Работает программа для поиска палиндрома в пятизначном числе с помощью библиотеки Dictionary");
    int num = ReadInputInt("Введите пятизначное число: ");

    int len = num.ToString().Length;
    if (len == 5)
    {
        int firstnumber = num / 1000;
        int lastnumber = num % 100;
        num = firstnumber * 100 + lastnumber;

        DictionarySearch(DictionaryAdd(), num);
    }
    else WriteMess("Вы ввели не пятизначное число");

}
Dictionary<int, string> DictionaryAdd()
{
    Dictionary<int, string> dict = new Dictionary<int, string>()
                    {
                                
                        [1111] = "палинндром", 	[1221] = "палинндром", 	[1331] = "палинндром", 	[1441] = "палинндром", 	[1551] = "палинндром", 	[1661] = "палинндром", 	[1771] = "палинндром", 	[1881] = "палинндром", 	[1991] = "палинндром", 
                        [2112] = "палинндром", 	[2222] = "палинндром", 	[2332] = "палинндром", 	[2442] = "палинндром", 	[2552] = "палинндром", 	[2662] = "палинндром", 	[2772] = "палинндром", 	[2882] = "палинндром", 	[2992] = "палинндром", 
                        [3113] = "палинндром", 	[3223] = "палинндром", 	[3333] = "палинндром", 	[3443] = "палинндром", 	[3553] = "палинндром", 	[3663] = "палинндром", 	[3773] = "палинндром", 	[3883] = "палинндром", 	[3993] = "палинндром", 
                        [4114] = "палинндром", 	[4224] = "палинндром", 	[4334] = "палинндром", 	[4444] = "палинндром", 	[4554] = "палинндром", 	[4664] = "палинндром", 	[4774] = "палинндром", 	[4884] = "палинндром", 	[4994] = "палинндром", 
                        [5115] = "палинндром", 	[5225] = "палинндром", 	[5335] = "палинндром", 	[5445] = "палинндром", 	[5555] = "палинндром", 	[5665] = "палинндром", 	[5775] = "палинндром", 	[5885] = "палинндром", 	[5995] = "палинндром", 
                        [6116] = "палинндром", 	[6226] = "палинндром", 	[6336] = "палинндром", 	[6446] = "палинндром", 	[6556] = "палинндром", 	[6666] = "палинндром", 	[6776] = "палинндром", 	[6886] = "палинндром", 	[6996] = "палинндром", 
                        [7117] = "палинндром", 	[7227] = "палинндром", 	[7337] = "палинндром", 	[7447] = "палинндром", 	[7557] = "палинндром", 	[7667] = "палинндром", 	[7777] = "палинндром", 	[7887] = "палинндром", 	[7997] = "палинндром", 
                        [8118] = "палинндром", 	[8228] = "палинндром", 	[8338] = "палинндром", 	[8448] = "палинндром", 	[8558] = "палинндром", 	[8668] = "палинндром", 	[8778] = "палинндром", 	[8888] = "палинндром", 	[8998] = "палинндром", 
                        [9119] = "палинндром", 	[9229] = "палинндром", 	[9339] = "палинндром", 	[9449] = "палинндром", 	[9559] = "палинндром", 	[9669] = "палинндром", 	[9779] = "палинндром", 	[9889] = "палинндром", 	[9999] = "палинндром", 

                    };
    return dict;
}
void DictionarySearch(Dictionary<int, string> dict, int numer)
{
    if (dict.ContainsKey(numer))
    {
        WriteMess($"Введеное число - {dict[numer]}");
    }
    else
    {
        WriteMess("Введеное число - не палиндром");
    }

}

ChoiceProggram();
